FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/msp432e401y/Networkinterface.c
/*
FreeRTOS+TCP V2.0.11
Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 http://aws.amazon.com/freertos
 http://www.FreeRTOS.org
*/

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include <ti/devices/msp432e4/inc/msp432.h>

#include <ti/devices/msp432e4/driverlib/emac.h>
#include <ti/devices/msp432e4/driverlib/gpio.h>
#include <ti/devices/msp432e4/driverlib/pin_map.h>

#include <ti/drivers/dpl/ClockP.h>
#include <ti/drivers/dpl/HwiP.h>

#include <ti/drivers/gpio/GPIOMSP432E4.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerMSP432E4.h>

/* FreeRTOS includes. */
#include "FreeRTOS_IP.h"
#include "NetworkBufferManagement.h"
#include "FreeRTOS_IP_Private.h"
#include "FreeRTOSIPConfig.h"

#include "MSP432E4_Networkinterface.h"

/* PHY phisical address, internal PHY */
#define PHY_PHYS_ADDR       0
#define NUM_RX_DESCRIPTORS  4
#define NUM_TX_DESCRIPTORS  4
#define EMAC_PHY_CONFIG         (EMAC_PHY_TYPE_INTERNAL |                     \
                                 EMAC_PHY_INT_MDIX_EN |                       \
                                 EMAC_PHY_AN_100B_T_FULL_DUPLEX)

/* The size of the CRC stored at the end of the received frames */
#define CRC_SIZE_BYTES 4

/* 
* NETWORK_BUFFER_DESCRIPTORS_LEN is defined as follow:
*
* ipTOTAL_ETHERNET_FRAME_SIZE =eth_header + mtu + crc + 4 = 1522 bytes
* ipBUFFER_PADDING = freertos space + ipconfigPACKET_FILLER_SIZE = 8+2 bytes 
* i +2 bytes servono al dma per non trascrivere i dati dei freertos space
* lunghezza totale deve essere multiplo di 4 allineato a 32bit
* ipBUFFER_PADDING deve essere lungo 4*N + 2 bytes. In questo caso 8+2.
* dma scrive i dati anche in memoria non allineate. tuttavia scrive sempre un multiplo di 4 bytes 
* con dummy bytes all inizio e alla fine. quindi se non allineata bisogna prevedere 
* dei byte tampone all inizio e fine nei confronti di ipTOTAL_ETHERNET_FRAME_SIZE
* che is pointed by pucEthernetBuffer pointer. 
* NETWORK_BUFFER_DESCRIPTORS_LEN=(ipTOTAL_ETHERNET_FRAME_SIZE + ipBUFFER_PADDING)
*/
#define NETWORK_BUFFER_DESCRIPTORS_LEN  1532

/*
 * pxGetNetworkBufferWithDescriptor return a staic allocated buffer of fixed size,
 * thus define a dummy buffersize
 */

#define GET_BUFFER_SIZE 0

/*
 * Define checksum related macros that are missing from driverlib
 *
 * The following bits in the RX DES0 descriptor have different meanings when
 * h/w checksum calculations are enabled. Define them here based on the default
 * macro values (default == h/w checksums disabled).
 */
/* RX DES0 bit 0 has payload checksum error status if EMACCFG IPC bit set */
#define EMAC_DES0_RX_STAT_PAYLOAD_CHKSM_ERR  DES0_RX_STAT_MAC_ADDR

/* RX DES0 bit 7 has IP header checksum error status if EMACCFG IPC bit set */
#define EMAC_DES0_RX_STAT_IPHDR_CHKSM_ERR  DES0_RX_STAT_TS_AVAILABLE


/* If ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES is set to 1, then the Ethernet
driver will filter incoming packets and only pass the stack those packets it
considers need processing. */
#if( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES == 0 )
#define ipCONSIDER_FRAME_FOR_PROCESSING( pucEthernetBuffer ) eProcessBuffer
#else
#define ipCONSIDER_FRAME_FOR_PROCESSING( pucEthernetBuffer ) eConsiderFrameForProcessing( ( pucEthernetBuffer ) )
#endif


/*
 *  Helper struct holding a DMA descriptor and the Network Buffer Descriptors it currently refers to.
 */
typedef struct {
    tEMACDMADescriptor Desc;
    NetworkBufferDescriptor_t *pxNetworkBuffer;
} DescriptorRef_t;

typedef struct {
    DescriptorRef_t *pxDescriptorRef;
    uint32_t     ulNumDescs;
    uint32_t     ulWrite;
    uint32_t     ulRead;
} DescriptorRefList_t;

/*
 * The struct is used to store the private data for the EMACMSP432E4 controller.
 */
typedef struct {
    uint32_t         ulRxCount;
    uint32_t         ulRxDropped;
    uint32_t         ulRxIpHdrChksmErrors;
    uint32_t         ulRxPayloadChksmErrors;
    uint32_t         ulTxSent;
    uint32_t         ulTxDropped;
    uint32_t         ulTxIpHdrChksmErrors;
    uint32_t         ulTxPayloadChksmErrors;
    uint32_t         ulDescriptorLoopCount[NUM_RX_DESCRIPTORS];
    uint32_t         ulAbnormalInts;
    uint32_t         ulIsrCount;
    BaseType_t       linkUp;
    DescriptorRefList_t *pxTxDescList;
    DescriptorRefList_t *pxRxDescList;
    HwiP_Handle      xHwi;
} EMAC_Data;

/*
 *  Signal the stack based on linkUp parameter.
 */
static void prvSignalLinkChange();

/* 
 * The function is used to initialize the DMA descriptors 
 */
static BaseType_t prvInitDMADescriptors();

/* 
 *The function is used to initialize and start the EMACMSP432E4
 *  controller and device.
 */
static BaseType_t prvEmacStart();

/* 
 * The function is used to deinitialize and stop the EMACMSP432E4 controller and device. 
 */
static BaseType_t prvEmacStop();


/*
 * prepare DMA Descriptor for RX 
 */
static void prvPrimeRx(NetworkBufferDescriptor_t *pxNetworkBuffer, DescriptorRef_t *desc);


/* 
 * private function called from ISR routine for processing recieve interrupts 
 */
static void prvHandleRx();

