FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/msp432e401y/Networkinterface.c
/*
 *  Signal the stack with IPStackEvent_t from ISR.
 */
static BaseType_t prvSendEventStructToIPTaskFromISR( const IPStackEvent_t *pxEvent);

/*
 * private function called from ISR routine for processing trasmit interrupts 
 */
static void prvProcessTransmitted();

/*private function called from ISR routine for processing PHY interrupts */
static void prvProcessPhyInterrupt();

/* 
 * EMAC ISR routine.
 * emac rx, tx and phy interrupts are handled by this function.
 */
static void prv_xHwiIntFxn(uintptr_t callbacks);

/*-------------------------------------------*/

/*
 * Static global variables for this interface's private data.
 */

static EMAC_Data xEMAC_prv;

static DescriptorRef_t g_pTxDescriptors[NUM_TX_DESCRIPTORS];
static DescriptorRef_t g_pRxDescriptors[NUM_RX_DESCRIPTORS];

static DescriptorRefList_t g_TxDescList = {
    g_pTxDescriptors, NUM_TX_DESCRIPTORS, 0, 0
};

static DescriptorRefList_t g_RxDescList = {
    g_pRxDescriptors, NUM_RX_DESCRIPTORS, 0, 0
};

/*
 * Static defined network buffers 32 bit aligned.
 */
static uint8_t ucBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS][NETWORK_BUFFER_DESCRIPTORS_LEN] __attribute__ ((aligned(32)));;


/* Application is required to provide this variable */
extern const EMACMSP432E4_HWAttrs EMACMSP432E4_hwAttrs;

/* The queue used to pass events into the IP-task for processing. */
extern QueueHandle_t xNetworkEventQueue;

/*-------------------------------------------*/

BaseType_t xNetworkInterfaceInitialise( void )
{
    /* initilaize  EMAC_Data private data */
    xEMAC_prv.pxTxDescList  = &g_TxDescList;
    xEMAC_prv.pxRxDescList  = &g_RxDescList;
    xEMAC_prv.ulRxCount      = 0;
    xEMAC_prv.ulRxDropped    = 0;
    xEMAC_prv.ulRxIpHdrChksmErrors = 0;
    xEMAC_prv.ulRxPayloadChksmErrors = 0;
    xEMAC_prv.ulTxSent       = 0;
    xEMAC_prv.ulTxDropped    = 0;
    xEMAC_prv.ulTxIpHdrChksmErrors = 0;
    xEMAC_prv.ulTxPayloadChksmErrors = 0;
    xEMAC_prv.ulAbnormalInts = 0;
    xEMAC_prv.ulIsrCount = 0;
    xEMAC_prv.linkUp       = pdFALSE;
    memset(xEMAC_prv.ulDescriptorLoopCount, 0,
            sizeof(xEMAC_prv.ulDescriptorLoopCount));

    if (prvEmacStart()== pdTRUE)
    {
        #if USE_DEFERRED_INTERRUPT
        #endif
        return pdTRUE;
    }
    else
    {
        return pdFALSE;
    }
}
/*-------------------------------------------*/

BaseType_t xNetworkInterfaceOutput( NetworkBufferDescriptor_t * const pxNetworkBuffer, BaseType_t xReleaseAfterSend )
{
    DescriptorRef_t *pxDesc;

    /* get descriptor reference */
    pxDesc = &(xEMAC_prv.pxTxDescList->pxDescriptorRef[xEMAC_prv.pxTxDescList->ulWrite]);
    
    /* if no dma buffer available*/
    if (pxDesc->pxNetworkBuffer) {
        vReleaseNetworkBufferAndDescriptor(pxNetworkBuffer);
        xEMAC_prv.ulTxDropped++;
        return pdFALSE;
    }

    /* Fill in the buffer pointer and length */
    pxDesc->Desc.ui32Count = pxNetworkBuffer->xDataLength;
    pxDesc->Desc.pvBuffer1 = pxNetworkBuffer->pucEthernetBuffer;
    pxDesc->Desc.ui32CtrlStatus = DES0_TX_CTRL_FIRST_SEG;

    /* CRC  IP offloading settings */
    #if ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM
    pxDesc->Desc.ui32CtrlStatus |= (DES0_TX_CTRL_IP_ALL_CKHSUMS);
    #endif
    pxDesc->Desc.ui32CtrlStatus |= DES0_TX_CTRL_CHAINED;

    pxDesc->Desc.ui32CtrlStatus |= (DES0_TX_CTRL_LAST_SEG |
                                    DES0_TX_CTRL_INTERRUPT);
    xEMAC_prv.pxTxDescList->ulWrite++;
    if (xEMAC_prv.pxTxDescList->ulWrite == NUM_TX_DESCRIPTORS) {
        xEMAC_prv.pxTxDescList->ulWrite = 0;
    }
    /* set the reference to the Network Buffer */
    pxDesc->pxNetworkBuffer = pxNetworkBuffer;
    pxDesc->Desc.ui32CtrlStatus |= DES0_TX_CTRL_OWN;

    xEMAC_prv.ulTxSent++;

    EMACTxDMAPollDemand(EMAC0_BASE);

    return pdTRUE;
}
/*-------------------------------------------*/

void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    BaseType_t x;

    for( x = 0; x < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; x++ )
    {
        /* pucEthernetBuffer is set to point ipBUFFER_PADDING bytes in from the
        beginning of the allocated buffer. */
        pxNetworkBuffers[ x ].pucEthernetBuffer = &( ucBuffers[ x ][ ipBUFFER_PADDING ] );

        /* The following line is also required, but will not be required in
        future versions. */
        *( ( uint32_t * ) &ucBuffers[ x ][ 0 ] ) = ( uint32_t ) &( pxNetworkBuffers[ x ] );
    }
}
/*-------------------------------------------*/

BaseType_t xGetPhyLinkStatus( void )
{
    uint32_t newLinkStatus;

    /* Check link status */
    newLinkStatus =
            (EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMSR) & EPHY_BMSR_LINKSTAT);

    /* Signal the stack if link status changed */
    if (newLinkStatus != xEMAC_prv.linkUp) {
        prvSignalLinkChange();//xEMAC_prv.hEvent, newLinkStatus, 0);
    }

    /* Set the link status */
    xEMAC_prv.linkUp = newLinkStatus;

    if (xEMAC_prv.linkUp) {
        return pdTRUE;
    }
    else {
        return pdFALSE;
    }
}
/*-------------------------------------------*/

/*
 *  EmacStart
 */
BaseType_t prvEmacStart()
{
    uint16_t value;
    EMACMSP432E4_HWAttrs const *hwAttrs = &EMACMSP432E4_hwAttrs;
    HwiP_Params xHwiParams;
    ClockP_FreqHz freq;
    uint32_t key;
    uint32_t pinMap;
    uint8_t  port;
    uint8_t  pin;
    //bool enablePrefetch = false;

    /* set power dependency on peripherals being used */
    Power_setDependency(PowerMSP432E4_PERIPH_EMAC0);
    Power_setDependency(PowerMSP432E4_PERIPH_EPHY0);

    /* Configure the appropriate pins for ethernet led0 */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->led0Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led0Pin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->led0Pin);

    Power_setDependency(GPIOMSP432E4_getPowerResourceId(port));
    GPIOPinConfigure(pinMap);
    GPIOPinTypeEthernetLED(GPIOMSP432E4_getGpioBaseAddr(port), pin);

    /* Configure the appropriate pins for ethernet led1 */
    pin = GPIOMSP432E4_getPinFromPinConfig(hwAttrs->led1Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led1Pin);
    pinMap = GPIOMSP432E4_getPinMapFromPinConfig(hwAttrs->led1Pin);

