FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/msp432e401y/Networkinterface.c
/*
 *  prvEmacStop 
 *  The function is used to de-initialize and stop the EMACMSP432E4
 *  controller and device.
 */
static BaseType_t prvEmacStop()
{
    EMACMSP432E4_HWAttrs const *hwAttrs = &EMACMSP432E4_hwAttrs;
    uint8_t  port;
    int i = 0;

    EMACIntDisable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                     EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                     EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    if (xEMAC_prv.xHwi != NULL) {
        HwiP_delete(xEMAC_prv.xHwi);
    }

    #if 0


    while (PBMQ_count(&xEMAC_prv.PBMQ_rx)) {
        /* Dequeue a packet from the driver receive queue. */
        pxNetworkBuffer = PBMQ_deq(&xEMAC_prv.PBMQ_rx);
        PBM_free(pxNetworkBuffer);
    }

    while (PBMQ_count(&xEMAC_prv.PBMQ_tx)) {
        /* Dequeue a packet from the driver receive queue. */
        pxNetworkBuffer = PBMQ_deq(&xEMAC_prv.PBMQ_tx);
        PBM_free(pxNetworkBuffer);
    }

    #endif

    for (i = 0; i < NUM_RX_DESCRIPTORS; i++) {
        if (g_pRxDescriptors[i].pxNetworkBuffer != NULL) {
            vReleaseNetworkBufferAndDescriptor(g_pRxDescriptors[i].pxNetworkBuffer);
        }
    }

    GPIOMSP432E4_undoPinConfig(hwAttrs->led0Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led0Pin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

    GPIOMSP432E4_undoPinConfig(hwAttrs->led1Pin);
    port = GPIOMSP432E4_getPortFromPinConfig(hwAttrs->led1Pin);
    Power_releaseDependency(GPIOMSP432E4_getPowerResourceId(port));

    Power_releaseDependency(PowerMSP432E4_PERIPH_EPHY0);
    Power_releaseDependency(PowerMSP432E4_PERIPH_EMAC0);

    return pdTRUE;
}
/*-------------------------------------------*/

/*
 * prvPrimeRx
 */
static void prvPrimeRx(NetworkBufferDescriptor_t *pxNetworkBuffer, DescriptorRef_t *desc)
{
    desc->pxNetworkBuffer = pxNetworkBuffer;
    desc->Desc.ui32Count = DES1_RX_CTRL_CHAINED;

    /* We got a buffer so fill in the payload pointer and size. */
    desc->Desc.pvBuffer1 = pxNetworkBuffer->pucEthernetBuffer;
    desc->Desc.ui32Count |= (NETWORK_BUFFER_DESCRIPTORS_LEN << DES1_RX_CTRL_BUFF1_SIZE_S);

    /* Give this descriptor back to the hardware */
    desc->Desc.ui32CtrlStatus = DES0_RX_CTRL_OWN;
}
/*-------------------------------------------*/


/*
 * prvHandleRx
 */
static void prvHandleRx()
{
    NetworkBufferDescriptor_t *pxNetworkBuffer;
    NetworkBufferDescriptor_t *pxNetworkBufferNew;
    int32_t          len;
    DescriptorRefList_t *pDescList;
    uint32_t         ulDescEnd;
    int32_t          descCount = -1;
    uint32_t         ui32Config;
    uint32_t         ui32Mode;
    uint32_t         ui32FrameSz;
    uint32_t         ui32CtrlStatus;

    IPStackEvent_t xRxEvent;

    /* Get a pointer to the receive descriptor list. */
    pDescList = xEMAC_prv.pxRxDescList;

    /* Determine where we start and end our walk of the descriptor list */
    ulDescEnd = pDescList->ulRead ?
            (pDescList->ulRead - 1) : (pDescList->ulNumDescs - 1);

    /* Step through the descriptors that are marked for CPU attention. */
    while (pDescList->ulRead != ulDescEnd) {
        descCount++;

        /* Does the current descriptor have a buffer attached to it? */
        pxNetworkBuffer = pDescList->pxDescriptorRef[pDescList->ulRead].pxNetworkBuffer;
        if (pxNetworkBuffer) {
            ui32CtrlStatus = pDescList->pxDescriptorRef[pDescList->ulRead].Desc.ui32CtrlStatus; 

            /* Determine if the host has filled it yet. */
            if (ui32CtrlStatus & DES0_RX_CTRL_OWN) {
                /* The DMA engine still owns the descriptor so we are finished. */
                break;
            }

            /* Yes - does the frame contain errors? */
            if (ui32CtrlStatus & DES0_RX_STAT_ERR) {
                /*
                 *  This is a bad frame. Update the relevant statistics and
                 *  then discard it.
                 */

                /*
                 * Check the EMAC configuration to see if RX h/w checksums are
                 * enabled. (The last 2 parameters are don't cares here)
                 */
                ui32Config = 0;
                EMACConfigGet(EMAC0_BASE, &ui32Config, &ui32Mode, &ui32FrameSz);
                if (ui32Config & EMAC_CONFIG_CHECKSUM_OFFLOAD) {
                    /* RX h/w checksums are enabled, look for checksum errors */

                    /* First check if the Frame Type bit is set */
                    if (ui32CtrlStatus & DES0_RX_STAT_FRAME_TYPE) {
                         /* Now, if bit 7 is reset and bit 0 is set: */
                         if (!(ui32CtrlStatus & EMAC_DES0_RX_STAT_IPHDR_CHKSM_ERR) &&
                             (ui32CtrlStatus & EMAC_DES0_RX_STAT_PAYLOAD_CHKSM_ERR)) {
                             /* Checksum error detected in the IP payload */
                             xEMAC_prv.ulRxPayloadChksmErrors++;
                         }
                         /* Else if bit 7 and bit 0 are both set */
                         else if ((ui32CtrlStatus & EMAC_DES0_RX_STAT_IPHDR_CHKSM_ERR) &&
                             (ui32CtrlStatus & EMAC_DES0_RX_STAT_PAYLOAD_CHKSM_ERR)) {
                             /* Checksum error in both IP header & payload */
                             xEMAC_prv.ulRxIpHdrChksmErrors++;
                             xEMAC_prv.ulRxPayloadChksmErrors++;
                        }
                         
                    }
                }

                xEMAC_prv.ulRxDropped++;
                prvPrimeRx(pxNetworkBuffer,
                        &(pDescList->pxDescriptorRef[pDescList->ulRead]));
                pDescList->ulRead++;
                break;
            }
            else {
                /* Allocate a new buffer for this descriptor */
                pxNetworkBufferNew = pxNetworkBufferGetFromISR(GET_BUFFER_SIZE);
                if (pxNetworkBufferNew == NULL) {
                    /*
                     *  Leave the packet in the descriptor and owned by the
                     *  driver. Process when the next interrupt occurs.
                     */
                    break;
                }

                /* This is a good frame so pass it up the stack. */
                len = (pDescList->pxDescriptorRef[pDescList->ulRead].Desc.ui32CtrlStatus &
                    DES0_RX_STAT_FRAME_LENGTH_M) >> DES0_RX_STAT_FRAME_LENGTH_S;

