FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/msp432e401y/Networkinterface.c
                /* Remove the CRC */
                pxNetworkBuffer->xDataLength= len - CRC_SIZE_BYTES;
                /*
                 *  Place the packet onto the receive queue to be handled in the
                 *  EMACMSP432E4_pkt_service function (which is called by the
                 *  NDK stack).
                 */
                /* Update internal statistic */
                xEMAC_prv.ulRxCount++;


                /* Prime the receive descriptor back up for future packets */
                prvPrimeRx(pxNetworkBufferNew,
                        &(pDescList->pxDescriptorRef[pDescList->ulRead]));
                
                xRxEvent.eEventType = eNetworkRxEvent;

                /* pvData is used to point to the network buffer descriptor that
                references the received data. */
                xRxEvent.pvData = ( void * ) pxNetworkBuffer;

                /* Send the data to the TCP/IP stack. */
                if( prvSendEventStructToIPTaskFromISR( &xRxEvent) == pdFALSE ){
                    /* The buffer could not be sent to the IP task so the buffer
                    must be released. */
                    vNetworkBufferReleaseFromISR( pxNetworkBuffer );

                    /* Make a call to the standard trace macro to log the
                    occurrence. */
                    //iptraceETHERNET_RX_EVENT_LOST();
                }
                else{
                    /* The message was successfully sent to the TCP/IP stack.
                    Call the standard trace macro to log the occurrence. */
                    //iptraceNETWORK_INTERFACE_RECEIVE();
                }                     
            }
        }
        /* Move on to the next descriptor in the chain, taking care to wrap. */
        pDescList->ulRead++;
        if (pDescList->ulRead == pDescList->ulNumDescs) {
            pDescList->ulRead = 0;
        }
    }

    /*
     * Update the desciptorLoopCount. This shows how frequently we are cycling
     * through x DMA descriptors, where x is the index of this array. So if
     * descriptorLoopcount[1] = 32, we had to cycle through 2 descriptors here
     * 32 times.
     */
    if(descCount >= 0 && descCount < NUM_RX_DESCRIPTORS) {
        xEMAC_prv.ulDescriptorLoopCount[descCount]++;
    }
}
/*-------------------------------------------*/


/*
 *   prvProcessTransmitted 
 */

static void prvProcessTransmitted()
{
    DescriptorRef_t *pDesc;
    uint32_t     ulNumDescs;

    /*
     * Walk the list until we have checked all descriptors or we reach the
     * write pointer or find a descriptor that the hardware is still working
     * on.
     */
    for (ulNumDescs = 0; ulNumDescs < NUM_TX_DESCRIPTORS; ulNumDescs++) {
        pDesc = &(xEMAC_prv.pxTxDescList->pxDescriptorRef[xEMAC_prv.pxTxDescList->ulRead]);
        /* Has the buffer attached to this descriptor been transmitted? */
        if (pDesc->Desc.ui32CtrlStatus & DES0_TX_CTRL_OWN) {
            /* No - we're finished. */
            break;
        }

        /*
         * Check this descriptor for transmit errors
         *
         * First, check the error summary to see if there was any error and if
         * so, check to see what type of error it was.
         */
        if (pDesc->Desc.ui32CtrlStatus & DES0_TX_STAT_ERR) {
            /* An error occurred - now look for errors of interest */

            /*
             * Ensure TX Checksum Offload is enabled before checking for IP
             * header error status (this status bit is reserved when TX CS
             * offload is disabled)
             */
            if (((pDesc->Desc.ui32CtrlStatus & DES0_TX_CTRL_IP_HDR_CHKSUM) ||
                (pDesc->Desc.ui32CtrlStatus & DES0_TX_CTRL_IP_ALL_CKHSUMS)) &&
                (pDesc->Desc.ui32CtrlStatus & DES0_TX_STAT_IPH_ERR)) {
                /* Error inserting IP header checksum */
                xEMAC_prv.ulTxIpHdrChksmErrors++;
            }

            if (pDesc->Desc.ui32CtrlStatus & DES0_TX_STAT_PAYLOAD_ERR) {
                /* Error in IP payload checksum (i.e. in UDP, TCP or ICMP) */
                xEMAC_prv.ulTxPayloadChksmErrors++;
            }
        }

        /* Does this descriptor have a buffer attached to it? */
        if (pDesc->pxNetworkBuffer) {
            /* Yes - free it*/
            vNetworkBufferReleaseFromISR(pDesc->pxNetworkBuffer);
            pDesc->pxNetworkBuffer = NULL;
        }
        else {
            /* If the descriptor has no buffer, we are finished. */
            break;
        }

        /* Move on to the next descriptor. */
        xEMAC_prv.pxTxDescList->ulRead++;
        if (xEMAC_prv.pxTxDescList->ulRead == NUM_TX_DESCRIPTORS) {
            xEMAC_prv.pxTxDescList->ulRead = 0;
        }
    }
}
/*-------------------------------------------*/


static void prvProcessPhyInterrupt()
{
    uint16_t value;
    uint16_t status;
    uint32_t config;
    uint32_t mode;
    uint32_t rxMaxFrameSize;

    /*
     * Read the PHY interrupt status.  This clears all interrupt sources.
     * Note that we are only enabling sources in EPHY_MISR1 so we don't
     * read EPHY_MISR2.
     */
    value = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_MISR1);

    /* Read the current PHY status. */
    status = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_STS);

    /* Has the link status changed? */
    if (value & EPHY_MISR1_LINKSTAT) {
        /* Is link up or down now? */
        if (status & EPHY_STS_LINK) {
            xEMAC_prv.linkUp = pdTRUE;
        }
        else {
            xEMAC_prv.linkUp = pdFALSE;
        }
        /* Signal the stack for this link status change (from ISR) */
        prvSignalLinkChange();//xEMAC_prv.hEvent,xEMAC_prv.linkUp, 1);
    }

    /* Has the speed or duplex status changed? */
    if (value & (EPHY_MISR1_SPEED | EPHY_MISR1_SPEED | EPHY_MISR1_ANC)) {
        /* Get the current MAC configuration. */
        EMACConfigGet(EMAC0_BASE, (uint32_t *)&config, (uint32_t *)&mode,
                        (uint32_t *)&rxMaxFrameSize);

        /* What speed is the interface running at now? */
        if (status & EPHY_STS_SPEED) {
            /* 10Mbps is selected */
            config &= ~EMAC_CONFIG_100MBPS;
        }
        else {
            /* 100Mbps is selected */
            config |= EMAC_CONFIG_100MBPS;
        }

        /* Are we in full- or half-duplex mode? */
        if (status & EPHY_STS_DUPLEX) {
            /* Full duplex. */
            config |= EMAC_CONFIG_FULL_DUPLEX;
        }
        else {
            /* Half duplex. */
            config &= ~EMAC_CONFIG_FULL_DUPLEX;
        }

        /* Reconfigure the MAC */
        EMACConfigSet(EMAC0_BASE, config, mode, rxMaxFrameSize);
    }
}
/*-------------------------------------------*/

