FreeRTOS/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/portable/NetworkInterface/msp432e401y/Networkinterface.c
/*
 * EMAC ISR routine
 * 
 * this function call:
 * - prvProcessPhyInterrupt in case of PHY Interrupts
 * - prvProcessTransmitted  in case of tx Interrupts
 * - prvHandleRx  in case of rx Interrupts
 */

static void prv_xHwiIntFxn(uintptr_t callbacks)
{
    uint32_t status;

    /* Check link status */
    status = (EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, EPHY_BMSR) & EPHY_BMSR_LINKSTAT);

    /* Signal the stack if link status changed */
    if (status != xEMAC_prv.linkUp) {
        prvSignalLinkChange();//xEMAC_prv.hEvent, status, 1);
    }

    /* Set the link status */
    xEMAC_prv.linkUp = status;

    xEMAC_prv.ulIsrCount++;

    /* Read and Clear the interrupt. */
    status = EMACIntStatus(EMAC0_BASE, true);
    EMACIntClear(EMAC0_BASE, status);

    /*
     *  Disable the Ethernet interrupts.  Since the interrupts have not been
     *  handled, they are not asserted.  Once they are handled by the Ethernet
     *  interrupt, it will re-enable the interrupts.
     */
    EMACIntDisable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                     EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                     EMAC_INT_RX_STOPPED | EMAC_INT_PHY));

    if (status & EMAC_INT_ABNORMAL_INT) {
        xEMAC_prv.ulAbnormalInts++;
    }

    if (status & EMAC_INT_PHY) {
        prvProcessPhyInterrupt();
    }

    /* Process the transmit DMA list, freeing any buffers that have been
     * transmitted since our last interrupt.
     */
    if (status & EMAC_INT_TRANSMIT) {
        prvProcessTransmitted();
    }

    /*
     * Process the receive DMA list and pass all successfully received packets
     * up the stack.  We also call this function in cases where the receiver has
     * stalled due to missing buffers since the receive function will attempt to
     * allocate new pbufs for descriptor entries which have none.
     */
    if (status & (EMAC_INT_RECEIVE | EMAC_INT_RX_NO_BUFFER |
        EMAC_INT_RX_STOPPED)) {
        prvHandleRx();
    }

    EMACIntEnable(EMAC0_BASE, (EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT |
                        EMAC_INT_TX_STOPPED | EMAC_INT_RX_NO_BUFFER |
                        EMAC_INT_RX_STOPPED | EMAC_INT_PHY));
}
/*---------------------------------------*/


/* prvSendEventStructToIPTaskFromISR
 * see xSendEventStructToIPTask in extern/FreeRTOS/FreeRTOS-Plus/Source/FreeRTOS-Plus-TCP/FreeRTOS_IP.c
 * this implementation is only for eNetworkRxEvent events. 
*/
static BaseType_t prvSendEventStructToIPTaskFromISR( const IPStackEvent_t *pxEvent){
        return xQueueSendToBackFromISR( xNetworkEventQueue, pxEvent,pdFALSE );
}
/*---------------------------------------*/

static void prvSignalLinkChange()
{

}
